{"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"module": "keras.layers.experimental", "class_name": "RandomFourierFeatures", "config": {"name": "random_fourier_features", "trainable": false, "dtype": "float32", "output_dim": 256, "kernel_initializer": "gaussian", "scale": null}, "registered_name": null}]}, "keras_version": "2.15.0", "backend": "tensorflow"}